

var x = [0.421683061, -3.427965117, -0.706076631, -1.273621676, -2.329491415, -2.263670712, -0.250318882, -1.201495276, -3.465029752, -3.145245341, -0.49623566, -1.223146102, -1.100833814, 1.980671906, 1.745069517, -0.752603525, 4.282362583, 4.221067037, -3.083359026, -3.12696227, -1.045941117, 2.80021003, 7.810303563, 1.601475365, -3.008658032, -0.960580487, -0.439446356, -1.982984349, -1.456959349, -2.343007, 5.442435141, 2.81069119, -2.245089672, -1.383704333, 0.48449723, 0.072492901, 1.973782133, 0.10035256, -2.259309811, 2.710503703, -3.33633085, 3.135582452, 5.026038604, -0.372458517, 4.711362579, -1.204312344, 4.36183688, -2.236052146, -3.571528874]
var y = [-0.969362249, -1.477880682, -1.500898634, 0.312685839, -2.467064299, 1.381874626, 2.343143023, 0.891165866, 1.144724994, 0.679946246, 0.599125826, -0.83560429, -0.700010237, -1.174707855, -0.313006064, 0.957838129, -1.574098338, -1.535607761, -1.248450566, -4.46641803, 3.914223872, 1.567058429, 0.028384875, 2.411463905, 3.457448515, 1.728270711, -0.892894893, -0.147605472, 0.10918607, 0.458544067, 0.841549912, -2.701830773, -0.794132988, -1.790819759, -3.404459438, -3.618072302, -0.794887087, 1.392832367, 0.754100669, -0.449055027, 3.099306765, -0.832193737, -0.442907718, 2.454633271, 1.978369922, 0.441561547, 3.194098004, -2.418805362, 0.40923611]
var text = ['헌터스 블랙트러플 포테이토칩', '허니버터칩', '프링글스 오리지널', '프링글스 사워크림 & 어니언', '포테토칩 트리플치즈', '포테토칩 오리지널', '포테토칩 먹태청양마요맛', '포테토칩 고추장마요맛', '포카칩 오리지널', '포스틱', '티카 칩스 파타고니아', '트릴라 칩스', '토레스 셀렉타 블랙트러플', '타키스 케틀즈 하바네로 퓨리', '타키스 케틀즈 푸에고', '크로키 감자칩 파프리카', '치오 팝칩 파프리카', '치오 토릴라 나초치즈', '조청유과', '인디안밥', '워커스 치즈 양파', '워커스 소금 식초', '워커스 새우', '워커스 레디 솔트', '예감 치즈그라탕맛', '양파링', '양파깡', '알새우칩', '아미카 엘도라다', '아미카 알프레도 오리지널러플', '스미스 소금 & 식초', '수미칩 오리지널', '새우깡', '빵부장 소금빵', '빵부장 라즈베리맛', '바나나킥', '무뚝뚝감자칩 통후추소금맛', '먹태깡 청양마요맛', '매운새우깡', '로렌즈 로즈마리', '레이즈 클래식', '레이즈 인도매직마살라', '레이즈 요피맛', '레이즈 소금 & 식초', '레이즈 미엥캄 향신료맛', '레이즈 맥스 칠리', '레이즈 구운새우와 해산물소스', '꿀꽈배기', '감자깡']
const targetData = [{
    x: x,
    y: y
}]

var anX = [-3.411309772, 5.39884487, 3.123085703, 0.034739266, -4.792580878, -4.237300163, 6.132789316, -1.657658973, -5.406360235, -0.335067915, -4.988810443, 5.873606157, 2.251763962, -5.028392729, -4.770771582, 3.416589443, 0.075119828, -2.075496763, 5.91038138, -2.870351539, -3.257113592, -2.438198365, 4.392380504, 0.764288344, -0.486920621, 1.85450245, 4.627090541, 2.378618173, 0.03775129]
var anY = [1.198137566, 3.122795017, -3.012795433, -6.102274171, -4.190712724, -2.692847821, 0.306388432, 8.34722797, 2.490001214, -2.036313439, 5.238057732, -0.301504988, 5.057116454, 5.280986807, 1.793093767, 1.054590842, 6.752905176, -7.1200139, -0.432521489, -2.460679355, -2.664242862, -3.473371408, 1.945705662, -2.620795516, 2.018997389, -3.053943937, 1.239494753, -1.892330448, 1.171982758]
var anText = ['Caramel', 'Citrus', 'Earthy', 'Floral', 'Fruity', 'Green', 'Herbal', 'Malty', 'Meaty', 'Mushroom', 'Nutty', 'Pine', 'Pungent', 'Roasted', 'Savory', 'Sour', 'Sulfurous', 'Sweet', 'Woody', 'Buttery', 'Creamy', 'Rancid', 'Fresh', 'Vanilla', 'Fishy', 'Fatty', 'Warm-Spicy', 'Slightly-Spicy', 'Balsamic']
const initialAnnotations = [];
const targetAnnotations = [];


var colorscale = [
    ['1.0', 'rgb(49,54,149)']
    ['0.888888888889', 'rgb(69,117,180)'],
    ['0.777777777778', 'rgb(116,173,209)'],
    ['0.666666666667', 'rgb(171,217,233)'],
    ['0.555555555556', 'rgb(224,243,248)'],
    ['0.444444444444', 'rgb(254,224,144)'],
    ['0.333333333333', 'rgb(253,174,97)'],
    ['0.222222222222', 'rgb(244,109,67)'],
    ['0.111111111111', 'rgb(215,48,39)'],
    ['0.0', 'rgb(165,0,38)'],
];

function rand(min, max) {
    return Math.floor((Math.random() * (max - min + 1)) + min);
}

// 방사형 선을 생성
for (let i = 0; i < anX.length; i++) {
    initialAnnotations.push({
        x: 0,
        y: 0,
        ax: 0,
        ay: 0,
        xref: 'x',
        yref: 'y',
        axref: 'x',
        ayref: 'y',
        showarrow: true,
        arrowhead: 2,
        arrowsize: 1,
        // arrowwidth: 2,
        arrowcolor: '#BCD955',
        standoff: 0,  // 화살표를 중심에서 시작하게 설정
        // text: i,  // 화살표 끝에 레이블 추가
        font: {
            size: 12,
            color: 'black'
        },
        xanchor: 'center',
        yanchor: 'center',  // 레이블을 화살표 끝에 붙이기 위해 위쪽으로 조정
    });

    targetAnnotations.push({
        x: anX[i],
        y: anY[i],
        ax: 0,
        ay: 0,
        xref: 'x',
        yref: 'y',
        axref: 'x',
        ayref: 'y',
        showarrow: true,
        arrowhead: 2,
        arrowsize: 1,
        // arrowwidth: 2,
        arrowcolor: '#BCD955',
        // standoff: 0,  // 화살표를 중심에서 시작하게 설정
        // text: anText[i],  // 화살표 끝에 레이블 추가
        font: {
            size: 12,
            color: 'black'
        },
        // xanchor: 'center',
        // yanchor: 'top',  // 레이블을 화살표 끝에 붙이기 위해 위쪽으로 조정
    });

}

var data = [{
    x: Array(9).fill(0),
    y: Array(9).fill(0),
    mode: 'markers',
    marker: {
        size: 12,
        color: x,
        colorscale: colorscale,
        opacity: 0.7,
    },
    text: text,
    hovertemplate: '<b>%{text}</b><br><br>(%{x}, %{y})<extra></extra>'
}];

var layout = {
    plot_bgcolor: "rgba(0,0,0,0)",
    paper_bgcolor: "rgba(0,0,0,0)",
    xaxis: {
        fixedrange: true,
        zeroline: false,
        range: [-8, 8],
    },
    yaxis: {
        fixedrange: true,
        zeroline: false,
        range: [-9, 9],
    },
    margin: {
        l: 30,
        r: 30,
        t: 30,
        b: 30,
        pad: 0
    },
    annotations: initialAnnotations,
    hoverlabel: { bgcolor: "#FFF" },
    // title: {
    //     text: '<b>NONGSHIM always find a better Flavor</b>',
    //     font: {
    //         family: 'sans-serif',
    //         size: 28
    //     },
    // },
};

// Plotly.newPlot('pca-plot', data, layout);

Plotly.newPlot('pca-plot-inner', data, layout).then(() => {
    // 애니메이션 실행
    Plotly.animate('pca-plot-inner', {
        data: targetData,
        layout: { annotations: targetAnnotations },
        traces: [0]
    }, {
        transition: { duration: 1000 },
        frame: { duration: 1000, redraw: false }
    });
});
