var values = [2.904158319, 2.039028234, 2.039028234, 1.822745712, 1.173898148, 1.173898148, 0.937953579, 0.937953579, 0.937953579, 0.741333105, 0.654820097, 0.574961935, 0.432358075, 0.432358075, 0.308768063, 0.308768063, 0.200626802, 0.200626802, 0.151471683, 0.105208042, 0.105208042, 0.020391367, 0.020391367, 0.020391367, -0.055497237, -0.12379698, -0.12379698, -0.185591986, -0.185591986, -0.185591986, -0.241769265, -0.241769265, -0.241769265, -0.340079502, -0.340079502, -0.383336006, -0.460236458, -0.460236458, -0.460236458, -1.421492109, -1.421492109, -1.421492109, -1.421492109, -1.421492109, -1.421492109, -1.421492109, -1.421492109, -1.421492109, -1.421492109, ];
var labels = ['포카칩 오리지널', '조청유과', '감자깡', '레이즈 클래식', '워커스 치즈 양파', '예감 치즈그라탕맛', '포스틱', '포테토칩 오리지널', '레이즈 소금 & 식초', '알새우칩', '트릴라 칩스', '프링글스 사워크림 & 어니언', '인디안밥', '프링글스 오리지널', '포테토칩 먹태청양마요맛', '허니버터칩', '레이즈 요피맛', '빵부장 소금빵', '티카 칩스 파타고니아', '포테토칩 고추장마요맛', '아미카 엘도라다', '아미카 알프레도 오리지널러플', '양파링', '양파깡', '매운새우깡', '포테토칩 트리플치즈', '꿀꽈배기', '레이즈 맥스 칠리', '로렌즈 로즈마리', '토레스 셀렉타 블랙트러플', '무뚝뚝감자칩 통후추소금맛', '치오 토릴라 나초치즈', '바나나킥', '먹태깡 청양마요맛', '타키스 케틀즈 하바네로 퓨리', '타키스 케틀즈 푸에고', '헌터스 블랙트러플 포테이토칩', '치오 팝칩 파프리카', '레이즈 인도매직마살라', '새우깡', '크로키 감자칩 파프리카', '빵부장 라즈베리맛', '수미칩 오리지널', '레이즈 미엥캄 향신료맛', '스미스 소금 & 식초', '워커스 소금 식초', '워커스 레디 솔트', '워커스 새우', '레이즈 구운새우와 해산물소스', ];
var binSize = 1;
var minBin = -1.5;
var maxBin = 3.5;

const flavorDetailbin3 = calculateBinFrequencies(values, binSize, minBin, maxBin);

// Chart.js용 데이터 준비
var dataLabels = flavorDetailbin3.map(bin => bin.range);
var dataValues = flavorDetailbin3.map(bin => bin.count);


var data = {
    labels: dataLabels,
    datasets: [{
        // label: 'My First Dataset',
        data: dataValues,
        fill: false,
        borderColor: '#38ABF2',
        tension: 0.4,
        pointRadius: 0,
    }]
};


var layout = {
    type: 'line',
    data: data,
    options: {
        plugins: {
            legend: {
                display: false,
            },
        },
        scales: {
            x: {
                grid: {
                    display: false                     // X축의 그리드 라인 없애기
                },
            },
            y: {
                grid: {
                    display: false                     // Y축의 그리드 라인 없애기
                },
            },
        },
    },
}

const lineArea3 = document.getElementById('flavor-line-plot3');
new Chart(lineArea3, layout);
