var values = [4.468897959, 3.582611749, 2.189876277, 2.075925192, 1.632782088, -0.317047574, -0.317047574, -0.317047574, -0.317047574, -0.317047574, -0.317047574, -0.317047574, -0.317047574, -0.317047574, -0.317047574, -0.317047574, -0.317047574, -0.317047574, -0.317047574, -0.317047574, -0.317047574, -0.317047574, -0.317047574, -0.317047574, -0.317047574, -0.317047574, -0.317047574, -0.317047574, -0.317047574, -0.317047574, -0.317047574, -0.317047574, -0.317047574, -0.317047574, -0.317047574, -0.317047574, -0.317047574, -0.317047574, -0.317047574, -0.317047574, -0.317047574, -0.317047574, -0.317047574, -0.317047574, -0.317047574, -0.317047574, -0.317047574, -0.317047574, -0.317047574, ];
var labels = ['치오 토릴라 나초치즈', '치오 팝칩 파프리카', '레이즈 맥스 칠리', '무뚝뚝감자칩 통후추소금맛', '레이즈 인도매직마살라', '스미스 소금 & 식초', '레이즈 요피맛', '레이즈 미엥캄 향신료맛', '워커스 새우', '워커스 소금 식초', '레이즈 구운새우와 해산물소스', '타키스 케틀즈 하바네로 퓨리', '워커스 레디 솔트', '타키스 케틀즈 푸에고', '로렌즈 로즈마리', '프링글스 사워크림 & 어니언', '워커스 치즈 양파', '포테토칩 먹태청양마요맛', '레이즈 소금 & 식초', '포테토칩 고추장마요맛', '아미카 엘도라다', '먹태깡 청양마요맛', '수미칩 오리지널', '포카칩 오리지널', '알새우칩', '인디안밥', '프링글스 오리지널', '토레스 셀렉타 블랙트러플', '조청유과', '크로키 감자칩 파프리카', '레이즈 클래식', '트릴라 칩스', '양파깡', '아미카 알프레도 오리지널러플', '양파링', '예감 치즈그라탕맛', '바나나킥', '포스틱', '포테토칩 오리지널', '헌터스 블랙트러플 포테이토칩', '감자깡', '허니버터칩', '티카 칩스 파타고니아', '매운새우깡', '빵부장 라즈베리맛', '포테토칩 트리플치즈', '꿀꽈배기', '새우깡', '빵부장 소금빵', ];
var binSize = 1;
var minBin = -0.5;
var maxBin = 4.5;

const flavorDetailbins2 = calculateBinFrequencies(values, binSize, minBin, maxBin);

// Chart.js용 데이터 준비
var dataLabels = flavorDetailbins2.map(bin => bin.range);
var dataValues = flavorDetailbins2.map(bin => bin.count);


var data = {
    labels: dataLabels,
    datasets: [{
        // label: 'My First Dataset',
        data: dataValues,
        fill: false,
        borderColor: '#38ABF2',
        tension: 0.4,
        pointRadius: 0,
    }]
};


var layout = {
    type: 'line',
    data: data,
    options: {
        plugins: {
            legend: {
                display: false,
            },
        },
        scales: {
            x: {
                grid: {
                    display: false                     // X축의 그리드 라인 없애기
                },
            },
            y: {
                grid: {
                    display: false                     // Y축의 그리드 라인 없애기
                },
            },
        },
    },
}

const lineArea2 = document.getElementById('flavor-line-plot2');
new Chart(lineArea2, layout);
